namespace LuckDraw.Models.WowRole
{
    class Enum_WowRole
    {
        public enum Enum_Occupation
        {
            //                        熊猫人 德莱尼人 矮人 人类 侏儒 暗夜精灵 狼人 血精灵 亡灵 地精 兽人 牛头人 巨魔
            死亡骑士 = 12287,     //1    0      1      1    1   1      1     1     1     1   1    1     1    1                
            德鲁伊 = 8387,        //1    0      0      0    0   0      1     1     0     0   0    0     1    1           
            猎人 = 16127,         //1    1      1      1    1   0      1     1     1     1   1    1     1    1    
            法师 = 16381,         //1    1      1      1    1   1      1     1     1     1   1    1     0    1    
            武僧 = 16311,         //1    1      1      1    1   1      1     0     1     1   0    1     1    1    
            圣骑士 = 11810,       //1    0      1      1    1   0      0     0     1     0   0    0     1    0        
            牧师 = 16379,         //1    1      1      1    1   1      1     1     1     1   1    0     1    1    
            潜行者 = 14333,       //1    1      0      1    1   1      1     1     1     1   1    1     0    1     
            萨满祭司 = 15375,     //1    1      1      1    0   0      0     0     0     0   1    1     1    1        
            战士 = 16383,         //1    1      1      1    1   1      1     1     1     1   1    1     1    1   
            术士 = 10109          //1    0      0      1    1   1      0     1     1     1   1    1     0    1       
        }

        public enum Enum_Race
        {
            熊猫人,
            德莱尼人,
            矮人,
            人类,
            侏儒,
            暗夜精灵,
            狼人,
            血精灵,
            亡灵,
            地精,
            兽人,
            牛头人,
            巨魔
        }
    }
}
